app/Controllers/Api/LivresManuel.php

    public function show($id)
    {
        $livre = model(LivreModel::class)->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = '1'